// Samvatsaras
// Number	Name (IAST)[5][6]	Name (Devanagari)	Name (Tamil)	Name (Telugu)	Name (Kannada)	Current cycle (Vikram Samvat)	Current cycle
// (Gregorian)
//
// Prior cycle 1	Prior cycle 2
// 1.	  Prabhava	प्रभव	பிரபவ	ప్రభవ	ಪ್ರಭವ	2044	1987-1988 CE	1927-1928 CE	1867-1868 CE
// 2.	  Vibhava	विभव	விபவ	విభవ	ವಿಭವ	2045	1988-1989 CE	1928-1929 CE	1868-1869 CE
// 3.	  sukla	शुक्ल	சுக்ல	శుక్ల	ಶುಕ್ಲ	2046	1989-1990 CE	1929-1930 CE	1869-1870 CE
// 4.	  Pramodaduta	प्रमोद	பிரமோதூத	ప్రమోద్యూత	ಪ್ರಮೋದೂತ	2047	1990-1991 CE	1930-1931 CE	1870-1871 CE
// 5.	  Prajapati	प्रजापति	பிரசோற்பத்தி	ప్రజోత్పత్తి	ಪ್ರಜಾಪತಿ	2048	1991-1992 CE	1931-1932 CE	1871-1872 CE
// 6.	  angirasa	अंगिरस	ஆங்கீரச	ఆంగీరస	ಅಂಗಿರಸ	2049	1992-1993 CE	1932-1933 CE	1872-1873 CE
// 7.	  srimukha	श्रीमुख	ஸ்ரீமுக	శ్రీముఖ	ಶ್ರೀಮುಖ	2050	1993-1994 CE	1933-1934 CE	1873-1874 CE
// 8.	  Bhava	भाव	பவ	భావ	ಭಾವ	2051	1994-1995 CE	1934-1935 CE	1874-1875 CE
// 9.	  Yuva	युव	யுவ	యువ	ಯುವ	2052	1995-1996 CE	1935-1936 CE	1875-1876 CE
// 10.	Dhatru	धाता/धातृ	தாத்ரு / தாதா	ధాత	ಧಾತೃ	2053	1996-1997 CE	1936-1937 CE	1876-1877 CE
// 11.	isvara	ईश्वर	ஈஸ்வர	ఈశ్వర	ಈಶ್ವರ	2054	1997-1998 CE	1937-1938 CE	1877-1878 CE
// 12.	Bahudhanya	बहुधान्य	பஹுதான்ய	బహుధాన్య	ಬಹುಧಾನ್ಯ	2055	1998-1999 CE	1938-1939 CE	1878-1879 CE
// 13.	Pramathi	प्रमाथी	பிரமாதி	ప్రమాధి	ಪ್ರಮಾಥಿ	2056	1999-2000 CE	1939-1940 CE	1879-1880 CE
// 14.	Vikrama	विक्रम	விக்ரம	విక్రమ	ವಿಕ್ರಮ	2057	2000-2001 CE	1940-1941 CE	1880-1881 CE
// 15.	Vrushapraja	वृषप्रजा	விஷு / வருஷப்ரஜா	వృశాప్రజా	ವೃಷಪ್ರಜಾ	2058	2001-2002 CE	1941-1942 CE	1881-1882 CE
// 16.	Citrabhanu	चित्रभानु	சித்ரபானு	చిత్రభాను	ಚಿತ್ರಭಾನು	2059	2002-2003 CE	1942-1943 CE	1882-1883 CE
// 17.	Svabhanu	स्वभानु	சுபானு / ச்வபானு	స్వభాను	ಸ್ವಭಾನು	2060	2003-2004 CE	1943-1944 CE	1883-1884 CE
// 18.	Tarana	तारण	தாரண	తారణ	ತಾರಣ	2061	2004-2005 CE	1944-1945 CE	1884-1885 CE
// 19.	Parthiva	पार्थिव	பார்திவ	పార్థివ	ಪಾರ್ಥಿವ	2062	2005-2006 CE	1945-1946 CE	1885-1886 CE
// 20.	Vyaya	अव्यय/व्यय	அவ்யய / வ்யய	వ్యయ	ವ್ಯಯ	2063	2006-2007 CE	1946-1947 CE	1886-1887 CE
// 21.	Sarvajit	सर्वजीत	சர்வஜித்	సర్వజిత	ಸರ್ವಜಿತ್	2064	2007-2008 CE	1947-1948 CE	1887-1888 CE
// 22.	Sarvadhari	सर्वधारी	சர்வதாரி	సర్వధారి	ಸರ್ವಧಾರಿ	2065	2008-2009 CE	1948-1949 CE	1888-1889 CE
// 23.	Virodhi	विरोधी	விரோதி	విరోధి	ವಿರೋಧಿ	2066	2009-2010 CE	1949-1950 CE	1889-1890 CE
// 24.	Vikruti	विकृति	விக்ருதி	వికృతి	ವಿಕೃತಿ	2067	2010-2011 CE	1950-1951 CE	1890-1891 CE
// 25.	Khara	खर	கர	ఖర	ಖರ	2068	2011-2012 CE	1951-1952 CE	1891-1892 CE
// 26.	Nandana	नंदन	நந்தன	నందన	ನಂದನ	2069	2012-2013 CE	1952-1953 CE	1892-1893 CE
// 27.	Vijaya	विजय	விஜய	విజయ	ವಿಜಯ	2070	2013-2014 CE	1953-1954 CE	1893-1894 CE
// 28.	Jaya	जय	ஜய	జయ	ಜಯ	2071	2014-2015 CE	1954-1955 CE	1894-1895 CE
// 29.	Manmatha	मन्मथ	மன்மத	మన్మధ	ಮನ್ಮಥ	2072	2015-2016 CE	1955-1956 CE	1895-1896 CE
// 30.	Durmukha	दुर्मुख	துற்முக	దుర్ముఖ	ದುರ್ಮುಖ	2073	2016-2017 CE	1956-1957 CE	1896-1897 CE
// 31.	Hevilambi	हेविळंबि	ஹேவிளம்பி	హేవిళంబి	ಹೇವಿಳಂಬಿ	2074	2017-2018 CE	1957-1958 CE	1897-1898 CE
// 32.	Vilambi	विळंबि	விளம்பி	విళంబి	ವಿಳಂಬಿ	2075	2018-2019 CE	1958-1959 CE	1898-1899 CE
// 33.	Vikari	विकारी	விகாரி	వికారి	ವಿಕಾರಿ	2076	2019-2020 CE	1959-1960 CE	1899-1900 CE
// 34.	sarvari	शार्वरी	சார்வரி	శార్వరి	ಶಾರ್ವರಿ	2077	2020-2021 CE	1960-1961 CE	1900-1901 CE
// 35.	Plava	प्लव	ப்லவ	ప్లవ	ಪ್ಲವ	2078	2021-2022 CE	1961-1962 CE	1901-1902 CE
// 36.	subhakruta	शुभकृत	சுபகிருத	శుభకృత	ಶುಭಕೃತ	2079	2022-2023 CE	1962-1963 CE	1902-1903 CE
// 37.	sobhakruta	शोभकृत	சோபக்ருத	శోభకృత	ಶೋಭಕೃತ	2080	2023-2024 CE	1963-1964 CE	1903-1904 CE
// 38.	Krodhi	क्रोधी	க்ரோதி	క్రోధి	ಕ್ರೋಧಿ	2081	2024-2025 CE	1964-1965 CE	1904-1905 CE
// 39.	Visvavasu	विश्वावसु	விஸ்வாவசு	విశ్వావసు	ವಿಶ್ವಾವಸು	2082	2025-2026 CE	1965-1966 CE	1905-1906 CE
// 40.	Parabhava	पराभव	பராபவ	పరాభవ	ಪರಾಭವ	2083	2026-2027 CE	1966-1967 CE	1906-1907 CE
// 41.	Plavanga	प्लवंग	ப்லவங்க	ప్లవంగ	ಪ್ಲವಂಗ	2084	2027-2028 CE	1967-1968 CE	1907-1908 CE
// 42.	Kilaka	कीलक	கீலக	కీలక	ಕೀಲಕ	2085	2028-2029 CE	1968-1969 CE	1908-1909 CE
// 43.	Saumya	सौम्य	சௌம்ய	సౌమ్య	ಸೌಮ್ಯ	2086	2029-2030 CE	1969-1970 CE	1909-1910 CE
// 44.	Sadharana	साधारण	சாதாரண	సాధారణ	ಸಾಧಾರಣ	2087	2030-2031 CE	1970-1971 CE	1910-1911 CE
// 45.	Virodhakruta	विरोधकृत	விரோதகிருத	విరోధికృత	ವಿರೋಧಿಕೃತ್	2088	2031-2032 CE	1971-1972 CE	1911-1912 CE
// 46.	Paridhavi	परिधावी	பரிதாவி	పరిధావి	ಪರಿಧಾವಿ	2089	2032-2033 CE	1972-1973 CE	1912-1913 CE
// 47.	Pramadi	प्रमादी	பிரமாதீ	ప్రమాదీచ	ಪ್ರಮಾದಿ	2090	2033-2034 CE	1973-1974 CE	1913-1914 CE
// 48.	ananda	आनंद	ஆனந்த	ఆనంద	ಆನಂದ	2091	2034-2035 CE	1974-1975 CE	1914-1915 CE
// 49.	Rakshasa	राक्षस	ராட்சச	రాక్షస	ರಾಕ್ಷಸ	2092	2035-2036 CE	1975-1976 CE	1915-1916 CE
// 50.	Nala/Anala	नल/अनल	நள	నల	ನಲ (ಅನಲ)	2093	2036-2037 CE	1976-1977 CE	1916-1917 CE
// 51.	Pingala	पिंगल	பிங்கள	పింగళ	ಪಿಂಗಲ	2094	2037-2038 CE	1977-1978 CE	1917-1918 CE
// 52.	Kalayukta	कालयुक्त	காளயுக்தி	కాళయుక్తి	ಕಾಲಯುಕ್ತ	2095	2038-2039 CE	1978-1979 CE	1918-1919 CE
// 53.	Siddharthi	सिद्धार्थी	சித்தார்த்தி	సిద్ధార్థ	ಸಿದ್ಧಾರ್ಥಿ	2096	2039-2040 CE	1979-1980 CE	1919-1920 CE
// 54.	Raudra	रौद्र	ரௌத்ரி	రౌద్రి	ರೌದ್ರ	2097	2040-2041 CE	1980-1981 CE	1920-1921 CE
// 55.	Durmati	दुर्मति	துற்மதி	దుర్మతి	ದುರ್ಮತಿ	2098	2041-2042 CE	1981-1982 CE	1921-1922 CE
// 56.	Dundubhi	दुन्दुभी	துந்துபி	దుందుభి	ದುಂದುಭಿ	2099	2042-2043 CE	1982-1983 CE	1922-1923 CE
// 57.	Rudhirodgari	रूधिरोद्गारी	ருதிரோத்காரி	రుధిరోద్గారి	ರುಧಿರೋದ್ಗಾರಿ	2100	2043-2044 CE	1983-1984 CE	1923-1924 CE
// 58.	Raktakshi	रक्ताक्षी	ரக்தாட்சி	రక్తాక్షి	ರಕ್ತಾಕ್ಷಿ	2101	2044-2045 CE	1984-1985 CE	1924-1925 CE
// 59.	Krodhana/Manyu	क्रोधन	க்ரோதன	క్రోధన	ಕ್ರೋಧನ	2102	2045-2046 CE	1985-1986 CE	1925-1926 CE
// 60.	Akshaya	अक्षय	அட்சய	అక్షయ	ಅಕ್ಷಯ	2103	2046-2047 CE	1986-1987 CE	1926-1927 CE

enum Samvathsaram {
  prabhava,
  vibhava,
  sukla,
  pramodaduta,
  prajapati,
  angirasa,
  srimukha,
  bhava,
  yuva,
  dhatru,
  isvara,
  bahudhanya,
  pramathi,
  vikrama,
  vrushapraja,
  citrabhanu,
  svabhanu,
  tarana,
  parthiva,
  vyaya,
  sarvajit,
  sarvadhari,
  virodhi,
  vikruti,
  khara,
  nandana,
  vijaya,
  jaya,
  manmatha,
  durmukha,
  hevilambi,
  vilambi,
  vikari,
  sarvari,
  plava,
  subhakruta,
  sobhakruta,
  krodhi,
  visvavasu,
  parabhava,
  plavanga,
  kilaka,
  saumya,
  sadharana,
  virodhakruta,
  paridhavi,
  pramadi,
  ananda,
  rakshasa,
  nala,
  pingala,
  kalayukta,
  siddharthi,
  raudra,
  durmati,
  dundubhi,
  rudhirodgari,
  raktakshi,
  krodhana,
  akshaya
}
