// తిథి	అధిదేవత	చేయతగిన కార్యములు	ఫలితములు
// 1. పాడ్యమి	శ్రద్ధ [[]]	శ్రద్ధతో పనిచేయుట, పనులయందు జాగరూకత	శ్రుతము, శాస్త్రముల ఆచరించుట
// 2.విదియ	మైత్రి	కొత్త పరిచయాలు, మంచి మిత్రులు, చికిత్సారంభం	ప్రసాదము, మనోవికాసం
// 3.తదియ	దయ	ఆర్తులకు సేవచేయుట	అభయం- నిర్భయము, అభయమిచ్చుట
// 4.చవితి	శాంతి	ధ్యానము, సత్సంగము	సుఖము-కార్యసిద్ధి
// 5.పంచమి	తుష్టి	తృప్తి పడుట, అసంతృప్తిని విడచుట, ప్రజాహిత కార్యములు	ముదము-ఆనందము
// 6.షష్ఠి	పుష్టి	ఆతిథ్యము, మంచి భోజనము, కలహములు రాకుండా జాకరూకత	స్మయము- గర్వము కలుగుట
// 7.సప్తమి	క్రియ ప్రియము	నిష్టతో కార్యాచరణ, తపసు, వేద్యయనం, శరణాగతి	యోగము-దైవముతో యోగము, విగ్నములు తొలగుట, ప్రయోజనము
// 8.అష్టమి	స్వాహాదేవి	వ్యాయాయము, అగ్నికార్య్సములు, పోటీలో నిలుచుట, సిద్ధిని పొందుటకు చేయవలసిన కార్యములు, ఆరోగ్యకరమైన ఆహారం	శ్రమతో విజయమును సాధించుట
// 9.నవమి	ఉన్నతి	సత్పురుషుల సన్నిధిలో వినయముతో మెలగుట	దర్పం, అపురూపమైన విద్య, అధికారం, శక్తి, తెలివి వలన కలుగు దర్పం. గుర్తింపు కొరకు గొప్ప కొరకు పాటుపడుట నివారించని ఎడల పేదరికం సంభవించును
// 10.దశమి	బుద్ధి	వివేకముతో కార్యాచరణ చేయుట	అర్ధము-ప్రయోజనము, పరిస్థితులను సద్వినియోగపరచుట
// 11.ఏకాదశి	మేధ	కార్యములందు శుభం, విద్యలను సద్వినియోగపరచుకొనుట	స్మృతి-కావలసిన సమయంలో విద్యలు స్పురించి ప్రయోజనం సమకూరుట
// 12.ద్వాదశి	తితిక్ష	పరిస్థితులను, ఇతరుల ప్రవర్తనను ఓర్చుకొనుట	క్షేమం- ఓర్పువహించిన వారికి ఆపదలు రావు
// 13.త్రయోదశి	హ్రీ	కార్యములందు శుభం, నైతికంగా దిగజారకుండా జాగరూయకత వహించుట	ప్రశ్రయం- చెడుపనులను చేయకుండుట, ఇతరుల విశ్వాసం చూరగొనుట
// 14.చతుర్ధశి	మూర్తి	ఏ పని చేయక ఆత్మధ్యానం, పరమాత్మ ధ్యానం చేయుట	సకల సద్గుణములు కలుగును
// 15.పూర్ణిమ	సతీదేవి (శక్తి, షోడశి మాంగల్యాది దేవతలు)	దౌవధ్యానం, దేవీ ఉపాసన	ప్రజ్ఞ-జగన్మాత అనుగ్రహము, ఉన్నత లక్ష్యసిద్ధి
// 16.అమావాస్య	పితృలోకము	బ్రహ్మచర్య సాధన, పరబ్రహ్మ ధ్యానం	తేజస్సు, ధారణ శక్తి, జ్ఞానం, విజ్ఞానం, బ్రహ్మనిష్ట

enum Thidi {
  padyami,
  vidhiya,
  thadhiya,
  chavithi,
  panchami,
  shashti,
  sapthami,
  ashtami,
  navami,
  dhasami,
  ekadhasi,
  dwadhasi,
  thrayodhasi,
  chathurdasi,
  poornima,
  amavasya,
}
